espressif/esp-idf/components/soc/esp32c61/register/soc/apb_saradc_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Configure Register */
/** Type of saradc_ctrl register
 *  digital saradc configure register
 */
typedef union {
    struct {
        /** saradc_start_force : R/W; bitpos: [0]; default: 0;
         *  select software enable saradc sample
         */
        uint32_t saradc_start_force:1;
        /** saradc_start : R/W; bitpos: [1]; default: 0;
         *  software enable saradc sample
         */
        uint32_t saradc_start:1;
        uint32_t reserved_2:4;
        /** saradc_sar_clk_gated : R/W; bitpos: [6]; default: 1;
         *  SAR clock gated
         */
        uint32_t saradc_sar_clk_gated:1;
        /** saradc_sar_clk_div : R/W; bitpos: [14:7]; default: 4;
         *  SAR clock divider
         */
        uint32_t saradc_sar_clk_div:8;
        /** saradc_sar_patt_len : R/W; bitpos: [17:15]; default: 7;
         *  0 ~ 15 means length 1 ~ 16
         */
        uint32_t saradc_sar_patt_len:3;
        uint32_t reserved_18:5;
        /** saradc_sar_patt_p_clear : R/W; bitpos: [23]; default: 0;
         *  clear the pointer of pattern table for DIG ADC1 CTRL
         */
        uint32_t saradc_sar_patt_p_clear:1;
        uint32_t reserved_24:3;
        /** saradc_xpd_sar_force : R/W; bitpos: [28:27]; default: 0;
         *  force option to xpd sar blocks
         */
        uint32_t saradc_xpd_sar_force:2;
        /** saradc_saradc2_pwdet_drv : R/W; bitpos: [29]; default: 0;
         *  enable saradc2 power detect driven func.
         */
        uint32_t saradc_saradc2_pwdet_drv:1;
        /** saradc_wait_arb_cycle : R/W; bitpos: [31:30]; default: 1;
         *  wait arbit signal stable after sar_done
         */
        uint32_t saradc_wait_arb_cycle:2;
    };
    uint32_t val;
} adc_ctrl_reg_t;

/** Type of saradc_ctrl2 register
 *  digital saradc configure register
 */
typedef union {
    struct {
        /** saradc_meas_num_limit : R/W; bitpos: [0]; default: 0;
         *  enable max meas num
         */
        uint32_t saradc_meas_num_limit:1;
        /** saradc_max_meas_num : R/W; bitpos: [8:1]; default: 255;
         *  max conversion number
         */
        uint32_t saradc_max_meas_num:8;
        /** saradc_sar1_inv : R/W; bitpos: [9]; default: 0;
         *  1: data to DIG ADC1 CTRL is inverted, otherwise not
         */
        uint32_t saradc_sar1_inv:1;
        /** saradc_sar2_inv : R/W; bitpos: [10]; default: 0;
         *  1: data to DIG ADC2 CTRL is inverted, otherwise not
         */
        uint32_t saradc_sar2_inv:1;
        uint32_t reserved_11:1;
        /** saradc_timer_target : R/W; bitpos: [23:12]; default: 10;
         *  to set saradc timer target
         */
        uint32_t saradc_timer_target:12;
        /** saradc_timer_en : R/W; bitpos: [24]; default: 0;
         *  to enable saradc timer trigger
         */
        uint32_t saradc_timer_en:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} adc_ctrl2_reg_t;

/** Type of saradc_filter_ctrl1 register
 *  digital saradc configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:26;
        /** saradc_adc_filter_factor1 : R/W; bitpos: [28:26]; default: 0;
         *  Factor of saradc filter1
         */
        uint32_t saradc_adc_filter_factor1:3;
        /** saradc_adc_filter_factor0 : R/W; bitpos: [31:29]; default: 0;
         *  Factor of saradc filter0
         */
        uint32_t saradc_adc_filter_factor0:3;
    };
    uint32_t val;
} adc_filter_ctrl1_reg_t;

/** Type of saradc_fsm_wait register
 *  digital saradc configure register
 */
typedef union {
    struct {
        /** saradc_xpd_wait : R/W; bitpos: [7:0]; default: 8;
         *  saradc_xpd_wait
         */
        uint32_t saradc_xpd_wait:8;
        /** saradc_rstb_wait : R/W; bitpos: [15:8]; default: 8;
         *  saradc_rstb_wait
         */
        uint32_t saradc_rstb_wait:8;
        /** saradc_standby_wait : R/W; bitpos: [23:16]; default: 255;
         *  saradc_standby_wait
         */
        uint32_t saradc_standby_wait:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} adc_fsm_wait_reg_t;

/** Type of saradc_sar1_status register
 *  digital saradc configure register
 */
typedef union {
    struct {
        /** saradc_sar1_status : RO; bitpos: [31:0]; default: 536870912;
         *  saradc1 status about data and channel
         */
        uint32_t saradc_sar1_status:32;
    };
    uint32_t val;
} adc_sar1_status_reg_t;

/** Type of saradc_sar2_status register
 *  digital saradc configure register
 */
typedef union {
    struct {
        /** saradc_sar2_status : RO; bitpos: [31:0]; default: 536870912;
         *  saradc2 status about data and channel
         */
        uint32_t saradc_sar2_status:32;
    };
    uint32_t val;
} adc_sar2_status_reg_t;

/** Type of saradc_sar_patt_tab1 register
 *  digital saradc configure register
 */
typedef union {
    struct {
        /** saradc_sar_patt_tab1 : R/W; bitpos: [23:0]; default: 16777215;
         *  item 0 ~ 3 for pattern table 1 (each item one byte)
         */
        uint32_t saradc_sar_patt_tab1:24;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} adc_sar_patt_tab1_reg_t;

/** Type of saradc_sar_patt_tab2 register
 *  digital saradc configure register
 */
typedef union {
    struct {
        /** saradc_sar_patt_tab2 : R/W; bitpos: [23:0]; default: 16777215;
         *  Item 4 ~ 7 for pattern table 1 (each item one byte)
         */
        uint32_t saradc_sar_patt_tab2:24;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} adc_sar_patt_tab2_reg_t;

/** Type of saradc_onetime_sample register
 *  digital saradc configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:23;
        /** saradc_onetime_atten : R/W; bitpos: [24:23]; default: 0;
         *  configure onetime atten
         */
        uint32_t saradc_onetime_atten:2;
        /** saradc_onetime_channel : R/W; bitpos: [28:25]; default: 13;
         *  configure onetime channel
         */
        uint32_t saradc_onetime_channel:4;
        /** saradc_onetime_start : R/W; bitpos: [29]; default: 0;
         *  trigger adc onetime sample
         */
        uint32_t saradc_onetime_start:1;
        /** saradc_saradc2_onetime_sample : R/W; bitpos: [30]; default: 0;
         *  enable adc2 onetime sample
         */
        uint32_t saradc_saradc2_onetime_sample:1;
        /** saradc_saradc1_onetime_sample : R/W; bitpos: [31]; default: 0;
         *  enable adc1 onetime sample
         */
        uint32_t saradc_saradc1_onetime_sample:1;
    };
    uint32_t val;
} adc_onetime_sample_reg_t;

/** Type of saradc_arb_ctrl register
 *  digital saradc configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** saradc_adc_arb_apb_force : R/W; bitpos: [2]; default: 0;
         *  adc2 arbiter force to enableapb controller
         */
        uint32_t saradc_adc_arb_apb_force:1;
        /** saradc_adc_arb_rtc_force : R/W; bitpos: [3]; default: 0;
         *  adc2 arbiter force to enable rtc controller
         */
        uint32_t saradc_adc_arb_rtc_force:1;
        /** saradc_adc_arb_wifi_force : R/W; bitpos: [4]; default: 0;
         *  adc2 arbiter force to enable wifi controller
         */
        uint32_t saradc_adc_arb_wifi_force:1;
        /** saradc_adc_arb_grant_force : R/W; bitpos: [5]; default: 0;
         *  adc2 arbiter force grant
         */
        uint32_t saradc_adc_arb_grant_force:1;
        /** saradc_adc_arb_apb_priority : R/W; bitpos: [7:6]; default: 0;
         *  Set adc2 arbiterapb priority
         */
        uint32_t saradc_adc_arb_apb_priority:2;
        /** saradc_adc_arb_rtc_priority : R/W; bitpos: [9:8]; default: 1;
         *  Set adc2 arbiter rtc priority
         */
        uint32_t saradc_adc_arb_rtc_priority:2;
        /** saradc_adc_arb_wifi_priority : R/W; bitpos: [11:10]; default: 2;
         *  Set adc2 arbiter wifi priority
         */
        uint32_t saradc_adc_arb_wifi_priority:2;
        /** saradc_adc_arb_fix_priority : R/W; bitpos: [12]; default: 0;
         *  adc2 arbiter uses fixed priority
         */
        uint32_t saradc_adc_arb_fix_priority:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} adc_arb_ctrl_reg_t;

