espressif/esp-idf/components/soc/esp32c61/register/soc/apb_saradc_struct.h
typedef struct {
    volatile adc_ctrl_reg_t saradc_ctrl;
    volatile adc_ctrl2_reg_t saradc_ctrl2;
    volatile adc_filter_ctrl1_reg_t saradc_filter_ctrl1;
    volatile adc_fsm_wait_reg_t saradc_fsm_wait;
    volatile adc_sar1_status_reg_t saradc_sar1_status;
    volatile adc_sar2_status_reg_t saradc_sar2_status;
    volatile adc_sar_patt_tab1_reg_t saradc_sar_patt_tab1;
    volatile adc_sar_patt_tab2_reg_t saradc_sar_patt_tab2;
    volatile adc_onetime_sample_reg_t saradc_onetime_sample;
    volatile adc_arb_ctrl_reg_t saradc_arb_ctrl;
    volatile adc_filter_ctrl0_reg_t saradc_filter_ctrl0;
    volatile adc_sar1data_status_reg_t saradc_sar1data_status;
    volatile adc_sar2data_status_reg_t saradc_sar2data_status;
    volatile adc_thres0_ctrl_reg_t saradc_thres0_ctrl;
    volatile adc_thres1_ctrl_reg_t saradc_thres1_ctrl;
    volatile adc_thres_ctrl_reg_t saradc_thres_ctrl;
    volatile adc_int_ena_reg_t saradc_int_ena;
    volatile adc_int_raw_reg_t saradc_int_raw;
    volatile adc_int_st_reg_t saradc_int_st;
    volatile adc_int_clr_reg_t saradc_int_clr;
    volatile adc_dma_conf_reg_t saradc_dma_conf;
    volatile adc_clkm_conf_reg_t saradc_clkm_conf;
    volatile adc_apb_tsens_ctrl_reg_t saradc_apb_tsens_ctrl;
    volatile adc_tsens_ctrl2_reg_t saradc_tsens_ctrl2;
    volatile adc_cali_reg_t saradc_cali;
    volatile apb_tsens_wake_reg_t tsens_wake;
    volatile apb_tsens_sample_reg_t tsens_sample;
    uint32_t reserved_06c[228];
    volatile adc_ctrl_date_reg_t saradc_ctrl_date;
} adc_dev_t;

extern adc_dev_t ADC;

#ifndef __cplusplus
_Static_assert(sizeof(adc_dev_t) == 0x400, "Invalid size of adc_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
